CSI API ETABS v1
cLoadPatterns.GetAutoSeismicCode Method
 Retrieves the code name used for auto seismic parameters in Quake-type load patterns.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAutoSeismicCode(
	string Name,
	ref string CodeName
)
Function GetAutoSeismicCode (
	Name As String,
	ByRef CodeName As String
) As Integer
Dim instance As cLoadPatterns
Dim Name As String
Dim CodeName As String
Dim returnValue As Integer
returnValue = instance.GetAutoSeismicCode(Name,
	CodeName)
int GetAutoSeismicCode(
	String^ Name,
	String^% CodeName
)
abstract GetAutoSeismicCode :
        Name : string *
        CodeName : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing Quake-type load pattern.
CodeName
Type: System.String
 This is either blank or the name code used for the auto seismic parameters. Blank means no auto seismic load is specified for the Quake-type load pattern.
Return Value
Type: Int32
 Returns zero if the code is successfully retrieved; otherwise it returns a nonzero value.
Remarks
 An error is returned if the specified load pattern is not a Quake-type load pattern.
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim CodeName As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'add new load pattern
   ret = SapModel.LoadPatterns.Add("EQX", eLoadPatternType.Quake)
   'assign ASCE716 parameters
   Dim nDir() As Boolean
   Dim Eccen As Double
   Dim PeriodFlag As Long
   Dim CtType As Long
   Dim UserT As Double
   Dim UserZ As Boolean
   Dim TopZ As Double
   Dim BottomZ As Double
   Dim R As Double
   Dim Omega As Double
   Dim Cd As Double
   Dim I As Double
   Dim SS As Double
   Dim S1 As Double
   Dim TL As Double
   Dim SiteClass As Long
   Dim Fa As Double
   Dim Fv As Double
   ReDim nDir(6)
   nDir(1) = True
   nDir(2) = False
   nDir(3) = True
   nDir(4) = False
   nDir(5) = True
   nDir(6) = True
   TopZ = 32
   BottomZ = 14
   'set ASCE716 parameters
   ret = SapModel.LoadPatterns.AutoSeismic.SetASCE716("EQX", nDir, 0.04, 3, 1, 1.76, False, TopZ, BottomZ, 6, 3.5, 6.5, 1.5, 1.9, 1.1, 8, 3, 0, 0)
   'get auto seismic code
       ret = SapModel.LoadPatterns.GetAutoSeismicCode("EQX", CodeName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cLoadPatterns Interface
ETABSv1 Namespace